#ifndef MYMAIN_TASKS_H
#define MYMAIN_TASKS_H

#include "..\string_.h"

/// TASK 1
/// удалить из строки все пробельные символы
void removeNonLetters(char *s);

/// TASK 2
/// сократить количество пробелов между словами данного предложения до одного
void removeExtraSpaces(char *s);

/// TASK 3
/// преобразовать строку таким образом, чтобы цифры
/// каждого слова были перенесены в начало слова и изменить порядок следования
/// цифр в слове на обратный, а буквы – в конец слова, без изменения порядка
/// следования.

#endif //MYMAIN_TASKS_H
